glenn-edgar/motioncore-prototype/samd21/apps/register_dongle/main.c
// ============================================================================
// register_dongle - Seeeduino Xiao SAMD21
// Phase-2d merge:
//   * s_engine M-port            (blink_engine)
//   * libcomm SLIP+CRC framing   (blink_frame)
//   * register_dongle_v2 chain   (Linux waypoint, state machine + dispatch)
//
// Chain shape (v2; locked 2026-05-13 — see register_dongle_v2.lua):
//   io_call(send_register) once on first INIT
//   se_state_machine("dongle_state", {
//     BOOT case:        event_dispatch{ OP_REGISTER_ACK -> set state=OPERATIONAL }
//     OPERATIONAL case: se_fork(
//                         chain_flow{ o_call(send_heartbeat); tick_delay(3); reset },
//                         m_call(toggle_led),
//                         event_dispatch{ OP_PING -> o_call(send_pong) }
//                       )
//   })
//   se_return_halt()
//
// One USB-CDC port. s2m frames staged in the shared TX ring; main loop drains
// to CDC each iteration. RX path: tud_cdc_read -> frame_decoder_feed -> on
// FRAME_READY, s_expr_event_push(tree, SE_EVENT_TICK, meta.cmd, NULL). After
// every engine tick the main loop drains the event_queue, ticking the tree
// once per popped event so se_event_dispatch handlers fire.
// ============================================================================

#include <stdint.h>
#include <stddef.h>
#include <stdbool.h>
#include <string.h>

#include "bsp/board_api.h"
#include "tusb.h"
#include "samd21.h"     // CMSIS: NVIC_SystemReset (inline)

#include "s_engine_types.h"
#include "s_engine_module.h"
#include "s_engine_node.h"
#include "s_engine_rom.h"
#include "s_engine_event_queue.h"

#include "register_dongle_v2.h"

#include "frame.h"
#include "opcodes.h"
#include "flash_storage.h"
#include "shell_commands.h"  // firmware_sysinfo_t
#include "samd21_hal.h"      // hal_wdt_init/pet, hal_capture_reset_cause
#include "samd21_hal_pin.h"  // hal_pin_check_consistency
#include "samd21_interlocks.h"

// Implemented in user_functions.c.
extern void     register_dongle_load_commissioning(void);
extern uint32_t g_pending_commission_instance_id;
extern bool     shell_pending_push(const uint8_t* payload, uint8_t len);

// Deferred-reboot plumbing: handle_commission_set/clear sets the reboot time;
// the main loop waits for TX to drain (~200 ms), then triggers NVIC_SystemReset
// so the OP_COMMISSION_REPLY frame and any other in-flight bytes actually
// reach the host before USB renegotiates.
static volatile uint32_t g_reboot_at_ms = 0;   // 0 = no reboot pending

void firmware_request_reboot(uint32_t delay_ms) {
    g_reboot_at_ms = board_millis() + delay_ms;
    if (g_reboot_at_ms == 0) g_reboot_at_ms = 1;   // 0 reserved as sentinel
}

extern const s_engine_rom_t register_dongle_v2_module_rom;

// Layer-2 WDT pet — strong override of the weak no-op in s_engine_node.c.
// Called from s_expr_node_tick once per chain pump cycle (every 250 ms in
// this build). See wdt-layer2-pet-from-s-engine memory.
void s_engine_chip_wdt_pet(void) { hal_wdt_pet(); }

// ----------------------------------------------------------------------------
// Bump allocator.
// Linux v2 chain peak: 520 B with one tree active. Cortex-M0+ alignment is
// similar; 768 B leaves comfortable headroom for the larger op state machine.
// ----------------------------------------------------------------------------

#define BUMP_BUFFER_SIZE 768u

static uint8_t  g_bump_buffer[BUMP_BUFFER_SIZE] __attribute__((aligned(8)));
static size_t   g_bump_used = 0;
static size_t   g_bump_peak = 0;

static void* bump_malloc(void* ctx, size_t size) {
    (void)ctx;
    size_t aligned = (size + 7u) & ~(size_t)7u;
    if (g_bump_used + aligned > BUMP_BUFFER_SIZE) {
        return NULL;
    }
    void* p = &g_bump_buffer[g_bump_used];
    g_bump_used += aligned;
    if (g_bump_used > g_bump_peak) g_bump_peak = g_bump_used;
    return p;
}

static void bump_free(void* ctx, void* ptr) {
    (void)ctx; (void)ptr;
}

// ----------------------------------------------------------------------------
// firmware_get_sysinfo — SAMD21G18A implementation. Called by CMD_SYSINFO
// shell handler. Linker symbols are provided by seeeduino_xiao.ld.
//
// Flash layout: app starts at 0x2000 (8 KB bootloader reserved). _etext is
// end of code+rodata. The .data initializer follows _etext in flash and is
// copied to _srelocate..._erelocate in RAM at startup.
// ----------------------------------------------------------------------------
extern char _etext[];        // end of text+rodata in flash
extern char _srelocate[];    // start of .data in RAM
extern char _erelocate[];    // end   of .data in RAM
extern char _sbss[];         // start of .bss in RAM
extern char _ebss[];         // end   of .bss in RAM
extern char _sstack[];       // start of stack region in RAM
extern char _estack[];       // top of stack

#define SAMD21G18A_FLASH_TOTAL_KB  256u
#define SAMD21G18A_RAM_TOTAL_KB    32u
#define SAMD21_APP_FLASH_ORIGIN    0x2000u

void firmware_get_sysinfo(firmware_sysinfo_t* out) {
    out->flash_total_kb   = SAMD21G18A_FLASH_TOTAL_KB;
    out->flash_text_b     = (uint32_t)((uintptr_t)_etext - SAMD21_APP_FLASH_ORIGIN);
    out->flash_data_b     = (uint32_t)((uintptr_t)_erelocate - (uintptr_t)_srelocate);
    out->ram_total_kb     = SAMD21G18A_RAM_TOTAL_KB;
    out->ram_bss_b        = (uint32_t)((uintptr_t)_ebss - (uintptr_t)_sbss);
    out->ram_stack_b      = (uint32_t)((uintptr_t)_estack - (uintptr_t)_sstack);
    out->bump_capacity_b  = (uint32_t)BUMP_BUFFER_SIZE;
    out->bump_peak_b      = (uint32_t)g_bump_peak;
    out->uptime_ms        = (uint32_t)board_millis();
    out->cpu_clock_hz     = SystemCoreClock;
}

// Skips the double-precision math in se_log* — board_millis() returns
// uint32 ms directly, no __aeabi_dmul/ddiv pulled in (~3 KB flash saved).
// We don't register a get_time (double seconds) callback at all — leaving
// it NULL lets --gc-sections drop the dmul/ddiv code entirely.
static uint32_t engine_get_time_ms(void* ctx) {
    (void)ctx;
    return board_millis();
}

// ----------------------------------------------------------------------------
// Shared TX ring. user_functions.c references this via `extern`.
// 256 B sized to comfortably fit the largest expected frame (24 B register
// payload + 7 B s2m header + worst-case SLIP escapes).
// ----------------------------------------------------------------------------

// 1024 B sized to hold (a) the largest possible SHELL_REPLY (128 B payload +
// 8 B framing + SLIP-worst-case ≈ 280 B) plus (b) ~700 B of backlogged DBG_LOG
// / heartbeat / OP_EVENT bytes that may be queued during a long shell-handler
// run (cmd_adc_capture at 60 samples × 5 ms holds the loop for ~300 ms during
// which nothing drains). 256 B previously was tight enough that adc_capture
// replies were silently dropped — see samd21_adc_capture_bug_2026-05-28.
#define TX_RING_SIZE 1024u
static uint8_t       g_tx_ring_buf[TX_RING_SIZE];
frame_ring_t         g_tx_ring;

// ----------------------------------------------------------------------------
// Stack hardening (slice-4): paint .stack at boot with STACK_PAINT_VALUE,
// reserve the lowest 4 bytes at _sstack as a canary, then check the canary
// + scan for high-water mark after every chain pump tick. Overflow triggers
// a deferred reset so the diagnostic log line drains via TX ring first.
//
// Linker symbols (placed by seeeduino_xiao_noinit.ld):
//   _sstack — lowest address of the .stack region
//   _estack — highest address; initial SP value loaded by the vector table
//
// .noinit now sits ABOVE .stack (after slice-4 reorder), so SP dropping
// below _sstack writes into .bss/heap instead of corrupting g_interlock_persist.
// ----------------------------------------------------------------------------
// _sstack/_estack declared as `char[]` higher up in this file (for sysinfo).
#define STACK_PAINT_VALUE   0xDEADBEEFu
#define STACK_CANARY_VALUE  0xCAFEBABEu

volatile uint16_t g_stack_hwm_bytes      = 0;     // peak observed depth (bytes)
volatile uint16_t g_stack_size_bytes     = 0;     // total stack region size
volatile uint8_t  g_stack_canary_tripped = 0;     // 1 = overflow detected

// Slice 6 — feeds the IL_VIRT_T_SINCE_M2S virtual input. Updated every time
// rx_drain decodes a complete host frame; reset to board_millis() at boot so
// virtuals don't trip on the time-since-epoch right after a cold start.
volatile uint32_t g_last_m2s_rx_ms       = 0;

static void stack_paint_and_canary(void) {
    // Paint from _sstack up to (current SP - safety). Don't write above SP —
    // that would clobber our own stack frame.
    uint32_t sp;
    __asm__ volatile ("mov %0, sp" : "=r"(sp));
    uint32_t* p   = (uint32_t*)(uintptr_t)_sstack;
    uint32_t* end = (uint32_t*)(sp - 64);     // 64 B safety from current SP
    while (p < end) *p++ = STACK_PAINT_VALUE;
    // Canary at the LOWEST word — first thing overwritten by stack overflow.
    *(volatile uint32_t*)(uintptr_t)_sstack = STACK_CANARY_VALUE;
    g_stack_size_bytes = (uint16_t)((uintptr_t)_estack - (uintptr_t)_sstack);
}

// ----------------------------------------------------------------------------
// system_self_check (slice 5, defensive amendment D).
//
// Called at end of init, immediately before the for(;;) main loop. Validates
// every invariant the main loop assumes; any failure routes through panic()
// so the next boot prints [BOOT_IL] ... pn=N ... with the discriminator.
//
// Six invariants per slice-5 prep memory Q6 ratification:
//   1. Stack canary intact at _sstack
//   2. interlock_persist magic == INTERLOCK_MAGIC
//   3. interlock_persist version == INTERLOCK_PERSIST_VERSION
//   4. interlock_persist self_size == sizeof(interlock_persist_t)
//   5. HAL pin claim table has no duplicate non-shared owners
//   6. Crash record self-consistency (if last_pc != 0 then last_crashed_slot
//      must be 0xFF (no-slot) OR < INTERLOCK_MAX_SLOTS)
// ----------------------------------------------------------------------------

extern interlock_persist_t g_interlock_persist;   // declared in samd21_interlocks.h

static void system_self_check(void) {
    // 1. Stack canary
    if (*(volatile uint32_t*)(uintptr_t)_sstack != STACK_CANARY_VALUE) {
        panic(PANIC_INIT_CANARY_BAD, 0);
    }
    // 2. Persist magic
    if (g_interlock_persist.magic != INTERLOCK_MAGIC) {
        panic(PANIC_PERSIST_MAGIC_BAD, g_interlock_persist.magic);
    }
    // 3. Persist version
    if (g_interlock_persist.version != INTERLOCK_PERSIST_VERSION) {
        panic(PANIC_PERSIST_VERSION_BAD, g_interlock_persist.version);
    }
    // 4. Persist self_size
    if (g_interlock_persist.self_size != (uint16_t)sizeof(interlock_persist_t)) {
        panic(PANIC_PERSIST_SIZE_BAD, g_interlock_persist.self_size);
    }
    // 5. HAL pin claim table
    if (!hal_pin_check_consistency()) {
        panic(PANIC_HAL_PIN_DUPLICATE, 0);
    }
    // 6. Crash record consistency — if there's a recorded crash (last_pc != 0
    //    or panic_code != 0), the slot field must be either NONE (0xFF) or a
    //    valid slot index.
    {
        const interlock_crash_record_t* cr = &g_interlock_persist.crash;
        bool has_crash = (cr->last_pc != 0) || (cr->panic_code != PANIC_NONE);
        bool slot_ok   = (cr->last_crashed_slot == INTERLOCK_CRASHED_SLOT_NONE)
                      || (cr->last_crashed_slot < INTERLOCK_MAX_SLOTS);
        if (has_crash && !slot_ok) {
            panic(PANIC_CRASH_RECORD_BAD, cr->last_crashed_slot);
        }
    }
}

// ----------------------------------------------------------------------------
// RX frame decoder. Direction = M2S (5-byte header). Persistent state — the
// in_escape flag does NOT reset between calls. Frames feed in one byte at a
// time from tud_cdc_read; on FRAME_READY we push the cmd to the engine.
// ----------------------------------------------------------------------------

static frame_decoder_t g_rx_decoder;

// ----------------------------------------------------------------------------
// debug_packet_fn — bridges s_engine's debug_fn callback to libcomm OP_DBG_LOG.
// Every se_log / se_log_int / etc. invocation arrives here with a formatted
// "[timestamp] message" line; we wrap it in an s2m frame and stage it in the
// TX ring. Same drain path as heartbeats/pongs, so it competes for the same
// CFG_TUD_CDC_TX_BUFSIZE bytes — keep log output sparse.
// ----------------------------------------------------------------------------

static uint8_t g_dbg_seq = 0;

